<a href="https://colab.research.google.com/github/orizay/free-fonts/blob/master/%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%B6%84%EC%84%9D_%EC%8B%A4%EA%B8%B0_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#1. 파일 다운(drinks.csv)

In [1]:
!git clone https://github.com/Soyoung-Yoon/data_01

Cloning into 'data_01'...
remote: Enumerating objects: 47, done.
remote: Counting objects: 100% (47/47), done.
remote: Compressing objects: 100% (47/47), done.
remote: Total 47 (delta 15), reused 0 (delta 0), pack-reused 0
Unpacking objects: 100% (47/47), done.

#2. Colab에서 한글폰트 사용하기

# 3.알코올을 가장 많이 마히는 나라는?
- country: 국가명
- beer_servings: 맥주 소비량
- spirit_servings: 중류주 소비량(독주,알코올 함량 20%이상의 설탕을 첨가하지 않은 중류주)
- wine_servings: 와인 소비량
- total_litres_of_pure_alcohol: 순수 알코올
- continent: 대륙

In [2]:
#[2-0] 라이브러리 import
import pandas as pd

# 3-1.파일 가져오기
- csv 파일은 컬럼 구분이 콤마(,)로 이루어진 파일
- df = pd.read_csv(파일이름): csv 형식의 파일을 읽어 DataFrame객체로 가져옴
- DataFrame.to_csv(파일이름,index=True): DataFrame은 csv 파일로 저장
  - index는 제외하고 저장하기 위해서는 index=False로 지정

In [3]:
#[2-1]drink.csv 파일을 DataFrame으로 불러 오기 합니다
df = pd.read_csv('data_01/drinks.csv')

In [4]:
#[2-2]df의 데이터 모습을 확인하기 위해 첫 5개 데이터를 출력합니다
df.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0         AS
1      Albania             89  ...                           4.9         EU
2      Algeria             25  ...                           0.7         AF
3      Andorra            245  ...                          12.4         EU
4       Angola            217  ...                           5.9         AF

[5 rows x 6 columns]

In [5]:
#[2-3]df의 컬럼명을 한글로 변경합니다['국가', '맥주', '증류주', '와인', '알코올', '대륙']
df.columns = ['국가', '맥주', '증류주', '와인', '알코올', '대륙']
df.head(3)

            국가  맥주  증류주  와인  알코올  대륙
0  Afghanistan   0    0   0  0.0  AS
1      Albania  89  132  54  4.9  EU
2      Algeria  25    0  14  0.7  AF

In [6]:
#[2-4]df의 row의 개수와 각 columns의 정보 및 메모리 사용량을 확인하기
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국가      193 non-null    object
 1   맥주      193 non-null    int64
 2   증류주     193 non-null    int64
 3   와인      193 non-null    int64
 4   알코올     193 non-null    float64
 5   대륙      170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [7]:
#object 타입정보까지 확인하려면(info(memory_usage='deep'))
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국가      193 non-null    object
 1   맥주      193 non-null    int64
 2   증류주     193 non-null    int64
 3   와인      193 non-null    int64
 4   알코올     193 non-null    float64
 5   대륙      170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 29.0 KB

### '대륙'에 대한 정보가 부족한것을 확인할수 있습니다.이유가 무엇일 까요?
- 아시아: AS, 유럽: EU, 아프리카: AF, 북아메리카: NA, 남아메리카: SA, 오세아니아: OC

## 3-2.결측치 확인 및 해결
- 결측치
  - 값이 없음을 나타냄
  - NaN, NaT, None등으로 표시되며,NA,Value, MissingValue라고함

- 결측치 확인 
  - DataFrame.isna(): 결측치에 대해 True,아니면 False
  - DataFrame.isnull(): DataFrame.isna()와 동일함
  - DataFrame.notna(): 결측치가 이닌것에 대해 True, 결측치면 False
  - DataFrame.notnull(): DataFrame.isnull()와 동일함
  - Series에도 결측치 확인을 위한 isna() ~ notnull()의 메서드 있음
  - DataFrame.isna().sum(): 결측치에 대해 컬럼별 개수

## 데이터 종류 확인
- 주로 범주형 데이터데 사용함
  - 성별,지역,부서 등의 몇개의 그룹으로 표현되는 데이터
  - 수자 또는 문자열로 표현될수 있음
- Series.unique(): 결측치를 포함하여,중복을 제외환 데이터의 종류를 ndarray로 반환
- Series.value_counts(): 결측치를 포함하지 않으며, 데이터 종류별 개수를 Series로 반환

In [8]:
#[2-5] 대륙의 종류를 알아봅니다
# 결과를 보면 csv파일에서 'NA'로 되어 있는 데이터를 'NaN(nan)으로 가져온 것입니다.
df['대륙'].unique()

array(['AS', 'EU', 'AF', nan, 'SA', 'OC'], dtype=object)

In [9]:
pd.Series(df['대륙'].unique())

0     AS
1     EU
2     AF
3    NaN
4     SA
5     OC
dtype: object

In [10]:
#[2-6] 대륙별 개수를 알아봅니다
df['대륙'].value_counts()

AF    53
EU    45
AS    44
OC    16
SA    12
Name: 대륙, dtype: int64

In [11]:
#[2-7] 결측치를 컬럼 별로 집계해 봅니다
df.isna()

        국가     맥주    증류주     와인    알코올     대륙
0    False  False  False  False  False  False
1    False  False  False  False  False  False
2    False  False  False  False  False  False
3    False  False  False  False  False  False
4    False  False  False  False  False  False
..     ...    ...    ...    ...    ...    ...
188  False  False  False  False  False  False
189  False  False  False  False  False  False
190  False  False  False  False  False  False
191  False  False  False  False  False  False
192  False  False  False  False  False  False

[193 rows x 6 columns]

In [12]:
df.isna().sum()

국가      0
맥주      0
증류주     0
와인      0
알코올     0
대륙     23
dtype: int64

In [13]:
#[2-8] isna()를 사용해 대륙에서 결측치로 취급된 데이터만 출력해봅니다
#북아메리카(NA)에 포함되는 국가들인 것을 확인할 수 있습니다
df['대륙'].isna()

0      False
1      False
2      False
3      False
4      False
       ...
188    False
189    False
190    False
191    False
192    False
Name: 대륙, Length: 193, dtype: bool

In [14]:
df[df['대륙'].isna()]

                               국가   맥주  증류주   와인   알코올   대륙
5               Antigua & Barbuda  102  128   45   4.9  NaN
11                        Bahamas  122  176   51   6.3  NaN
14                       Barbados  143  173   36   6.3  NaN
17                         Belize  263  114    8   6.8  NaN
32                         Canada  240  122  100   8.2  NaN
41                     Costa Rica  149   87   11   4.4  NaN
43                           Cuba   93  137    5   4.2  NaN
50                       Dominica   52  286   26   6.6  NaN
51             Dominican Republic  193  147    9   6.2  NaN
54                    El Salvador   52   69    2   2.2  NaN
68                        Grenada  199  438   28  11.9  NaN
69                      Guatemala   53   69    2   2.2  NaN
73                          Haiti    1  326    1   5.9  NaN
74                       Honduras   69   98    2   3.0  NaN
84                        Jamaica   82   97    9   3.4  NaN
109                        Mexico  238   68    5   5.5  NaN
122                     Nicaragua   78  118    1   3.5  NaN
130                        Panama  285  104   18   7.2  NaN
143             St. Kitts & Nevis  194  205   32   7.7  NaN
144                     St. Lucia  171  315   71  10.1  NaN
145  St. Vincent & the Grenadines  120  221   11   6.3  NaN
174             Trinidad & Tobago  197  156    7   6.4  NaN
184                           USA  249  158   84   8.7  NaN

## 결측치 해결방법
- 'NA'를 'NaN'(결측치)로 읽는 동작을 멈추게 함
  - pd.read_csv(파일이름, na_filter=False): 파일에서 데이터를 가져올 때 결측치로 인지되는 데이터를 결측치로 읽어 오는 동작을 멈추도록 함

- 결측치를 다른 값으로 채우기 함
  - DataFrame.fillna(값) 또는 Sreies.fillna(값): 결측값을 특정 값으로 채우기
    - 연속형 데이터 : 0 을 채우기, 평균값으로 채우기, 범주별 평균값 채우기 등
    - 범주형 데이터 : 다른 범주로 만들어 채우기
- DataFrame.loc[Series.isna(), 컬럼명]=값

In [15]:
#[2-9] 해결방법1
#read_csv의 옵션을 사용하여 해결 함
#read_csv에서 'NA'를 'NaN'으로 읽도록 하는 동작을 멈추게 합니다.
#na_filter=False를 사용하면 'NA'를 'NaN'으로 읽지 않습니다.

temp = pd.read_csv('data_01/drinks.csv', na_filter=False)
temp

         country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0    Afghanistan              0  ...                           0.0         AS
1        Albania             89  ...                           4.9         EU
2        Algeria             25  ...                           0.7         AF
3        Andorra            245  ...                          12.4         EU
4         Angola            217  ...                           5.9         AF
..           ...            ...  ...                           ...        ...
188    Venezuela            333  ...                           7.7         SA
189      Vietnam            111  ...                           2.0         AS
190        Yemen              6  ...                           0.1         AS
191       Zambia             32  ...                           2.5         AF
192     Zimbabwe             64  ...                           4.7         AF

[193 rows x 6 columns]

In [16]:
#[2-10] temp의 'continent'(대륙)에 포함된 값의 종류를 unique()를 사용해 살펴 봅니다.
#'NaN'대신 'NA'가 있는 것을 확인할수 있습니다.
temp['continent'].unique()

array(['AS', 'EU', 'AF', 'NA', 'SA', 'OC'], dtype=object)

In [17]:
temp.isna().sum()

country                         0
beer_servings                   0
spirit_servings                 0
wine_servings                   0
total_litres_of_pure_alcohol    0
continent                       0
dtype: int64

In [19]:
#[2-10] 해결방법 2
# NaN으로 읽어온 데이터를 'NA'로 변경합니다
df['대륙'].fillna('NA'). # 그냥 이렇게 쓰면 적용이 안됩니다

0      AS
1      EU
2      AF
3      EU
4      AF
       ..
188    SA
189    AS
190    AS
191    AF
192    AF
Name: 대륙, Length: 193, dtype: object

In [20]:
df['대륙'] = df['대륙'].fillna('NA')

In [21]:
df

              국가   맥주  증류주   와인   알코올  대륙
0    Afghanistan    0    0    0   0.0  AS
1        Albania   89  132   54   4.9  EU
2        Algeria   25    0   14   0.7  AF
3        Andorra  245  138  312  12.4  EU
4         Angola  217   57   45   5.9  AF
..           ...  ...  ...  ...   ...  ..
188    Venezuela  333  100    3   7.7  SA
189      Vietnam  111    2    1   2.0  AS
190        Yemen    6    0    0   0.1  AS
191       Zambia   32   19    4   2.5  AF
192     Zimbabwe   64   18    4   4.7  AF

[193 rows x 6 columns]

In [22]:
df.loc[df['대륙'].isna(),'대륙'] = 'NA'

In [25]:
#[2-11] 결측치가 제거되었는지 컬럼 별 결측치 개수를 출력해 확인합니다
df.isna().sum()

국가     0
맥주     0
증류주    0
와인     0
알코올    0
대륙     0
dtype: int64

In [26]:
#[2-12] unique()를 사용하여 '대룩'의 종류를 확인해 봅니다
df['대륙'].unique()

array(['AS', 'EU', 'AF', 'NA', 'SA', 'OC'], dtype=object)

## 3-3. 통계값 구하기
- DataFrame.describer(): 컬럼별 count,mean, std, min, max, Q1, Q2, Q3 등의 통계값 구하기
- DataFrame.count(): 개수
- DataFrame.sum(): 합계
- DataFrame.mean(): 평균
- DataFrame.median(): 중앙값
- DataFrame.std(): 표준편차
- DataFrame.var(): 분산
- DataFrame.quantile(): 분위수
- DataFrame.함수(axis= 1)을 사용하여 행별 통계값을 구할수 있습니다
  - axis= 0 : 기본값이며, 행을 이동하며, 행과행의 연산을 수행함
  - axis= 1 : 컬럼을 이동하며 컬럼과 컬럼의 연산을 수행합

In [27]:
#[2-13] describe 함수를 사용해 전세계 맥주, 증류주, 와인, 알코올 소비에 대한 통계치를 구해봅니다
df.describe()

               맥주         증류주          와인         알코올
count  193.000000  193.000000  193.000000  193.000000
mean   106.160622   80.994819   49.450777    4.717098
std    101.143103   88.284312   79.697598    3.773298
min      0.000000    0.000000    0.000000    0.000000
25%     20.000000    4.000000    1.000000    1.300000
50%     76.000000   56.000000    8.000000    4.200000
75%    188.000000  128.000000   59.000000    7.200000
max    376.000000  438.000000  370.000000   14.400000

In [28]:
#[2-14] 전세계맥주, 증류주, 와인, 알코올 소비에 대한 정보만 추출하여 df2로 지정합니다
df2 = df[['맥주','증류주','와인','알코올']]
df2.head()

    맥주  증류주   와인   알코올
0    0    0    0   0.0
1   89  132   54   4.9
2   25    0   14   0.7
3  245  138  312  12.4
4  217   57   45   5.9

In [29]:
#[2-15] 전세계 맥주,증류주,와인, 알코올이 소비에 대한(df2)'평균'만 구해봅니다
df2.mean()

맥주     106.160622
증류주     80.994819
와인      49.450777
알코올      4.717098
dtype: float64

In [31]:
#[2-16] 전세계 맥주,증류주,와인, 알코올이 소비에 대한(df2)'중앙값'만 구해봅니다
df2.median()

맥주     76.0
증류주    56.0
와인      8.0
알코올     4.2
dtype: float64

In [32]:
#[2-17] 전세계 맥주,증류주,와인, 알코올이 소비에 대한(df2)'최대값'만 구해봅니다
df2.max()

맥주     376.0
증류주    438.0
와인     370.0
알코올     14.4
dtype: float64

In [33]:
#[2-18] 전세계 맥주,증류주,와인, 알코올이 소비에 대한(df2)'최소값'만 구해봅니다
df2.min()

맥주     0.0
증류주    0.0
와인     0.0
알코올    0.0
dtype: float64

In [34]:
#[2-19] 전세계 맥주,증류주,와인, 알코올이 소비에 대한(df2)'Q1, Q2, Q3를 구해봅니다
df2.quantile([0.25, 0.5, 0.75])

         맥주    증류주    와인  알코올
0.25   20.0    4.0   1.0  1.3
0.50   76.0   56.0   8.0  4.2
0.75  188.0  128.0  59.0  7.2

In [35]:
temp = df2.quantile([0.25, 0.5, 0.75])
temp.index = ['Q1','Q2','Q3']
temp

       맥주    증류주    와인  알코올
Q1   20.0    4.0   1.0  1.3
Q2   76.0   56.0   8.0  4.2
Q3  188.0  128.0  59.0  7.2

In [36]:
# * 전세계 맥주,증류주,와인, 알코올이 소비에 대한(df2)'표준편차','분산'에 대해서도 작업해봅니다
df2.std()

맥주     101.143103
증류주     88.284312
와인      79.697598
알코올      3.773298
dtype: float64

In [37]:
df2.var()

맥주     10229.927191
증류주     7794.119765
와인      6351.707200
알코올       14.237779
dtype: float64

In [38]:
#[2-20] df(object dtype이 존재함)에 대해서 컬럼별 min을 구해 봅니다
# dtype()이 object이 컬럼의 min은 오름차순 정렬시 가장앞에 있는것
# dtype()이 object이 컬럼의 max는 오름차순 정렬시 가장뒤에 있는것
# 문자열 정렬시에는 문자의 코드값을 사용함: ord(문자)
df.min()

국가     Afghanistan
맥주               0
증류주              0
와인               0
알코올              0
대륙              AF
dtype: object

In [39]:
df.max()

국가     Zimbabwe
맥주          376
증류주         438
와인          370
알코올        14.4
대륙           SA
dtype: object

In [41]:
ord('0'), ord('1'), ord('A'), ord('B'), ord('a'), ord('b')

(48, 49, 65, 66, 97, 98)